{
    "1": {"goal": "Press the light switch.", "complexity": 1, "ambiguity": 1},
    "2": {"goal": "Move to the plant.", "complexity": 2, "ambiguity": 1},
    "3": {"goal": "Go to the tv.", "complexity": 2, "ambiguity": 1},
    "4": {"goal": "Look at the lamp.", "complexity": 3, "ambiguity": 1},
    "5": {"goal": "Move to the couch.", "complexity": 3, "ambiguity": 1},
    "6": {"goal": "Observe the light on the ceiling.", "complexity": 4, "ambiguity": 3},
    "7": {"goal": "Navigate to the table near the couch.", "complexity": 5, "ambiguity": 5},
    "8": {"goal": "Go to the recycling bin.", "complexity": 5, "ambiguity": 1},
    "9": {"goal": "Move to the armchair.", "complexity": 6, "ambiguity": 1},
    "10": {"goal": "Inspect the cabinet.", "complexity": 7, "ambiguity": 5},
    "11": {"goal": "Go to the picture.", "complexity": 8, "ambiguity": 3},
    "12": {"goal": "Water the plant.", "complexity": 9, "ambiguity": 3},
    "13": {"goal": "Turn on the lamp.", "complexity": 10, "ambiguity": 5},
    "14": {"goal": "Check the cushion on the armchair.", "complexity": 11, "ambiguity": 5},
    "15": {"goal": "Move the water pitcher to the table.", "complexity": 12, "ambiguity": 7},
    "16": {"goal": "Turn the light switch on and off.", "complexity": 13, "ambiguity": 5},
    "17": {"goal": "Place an object in the recycling bin.", "complexity": 14, "ambiguity": 8},
    "18": {"goal": "Inspect the shelf contents.", "complexity": 15, "ambiguity": 7},
    "19": {"goal": "Retrieve the object on the table.", "complexity": 16, "ambiguity": 10},
    "20": {"goal": "Press the light switch near the cabinet.", "complexity": 17, "ambiguity": 12},
    "21": {"goal": "Move to the light switch at position [0.08, -0.91, 0.28].", "complexity": 18, "ambiguity": 5},
    "22": {"goal": "Find something to water the plant with.", "complexity": 19, "ambiguity": 13},
    "23": {"goal": "Check if there's anything inside the cabinet.", "complexity": 20, "ambiguity": 8},
    "24": {"goal": "Organize the objects on the table.", "complexity": 21, "ambiguity": 15},
    "25": {"goal": "Navigate between the couch and the table without touching either.", "complexity": 22, "ambiguity": 8},
    "26": {"goal": "Press the highest positioned light switch in the room.", "complexity": 23, "ambiguity": 12},
    "27": {"goal": "Examine the plant to see if it needs water.", "complexity": 24, "ambiguity": 10},
    "28": {"goal": "Pick up any object and place it on the shelf.", "complexity": 25, "ambiguity": 17},
    "29": {"goal": "Turn off all lights in the room.", "complexity": 26, "ambiguity": 13},
    "30": {"goal": "Move the object nearest to the light switch.", "complexity": 27, "ambiguity": 18},
    "31": {"goal": "Navigate to each piece of furniture in the room, starting with the closest.", "complexity": 28, "ambiguity": 15},
    "32": {"goal": "Press the light switch that's closest to the shelf.", "complexity": 29, "ambiguity": 20},
    "33": {"goal": "Find a container that could hold water for the plant.", "complexity": 30, "ambiguity": 22},
    "34": {"goal": "Identify all objects that could be used to play with.", "complexity": 31, "ambiguity": 23},
    "35": {"goal": "Move any small object from the table to the cabinet.", "complexity": 32, "ambiguity": 25},
    "36": {"goal": "Navigate to each light switch in the room in order from lowest to highest position.", "complexity": 33, "ambiguity": 17},
    "37": {"goal": "Inspect all objects that appear to be electronic.", "complexity": 34, "ambiguity": 27},
    "38": {"goal": "Retrieve an object from the cabinet and place it on the table near the couch.", "complexity": 35, "ambiguity": 18},
    "39": {"goal": "Find an object that could be used to clean the room.", "complexity": 36, "ambiguity": 28},
    "40": {"goal": "Inspect the room for any objects that might be out of place.", "complexity": 37, "ambiguity": 30},
    "41": {"goal": "Rearrange the objects on the shelf in order of size.", "complexity": 38, "ambiguity": 20},
    "42": {"goal": "Move to the center of the room and identify the closest object.", "complexity": 39, "ambiguity": 22},
    "43": {"goal": "Check if there are any objects that might pose a hazard for a child.", "complexity": 40, "ambiguity": 32},
    "44": {"goal": "Move to the plant, examine it, then find something to water it with.", "complexity": 41, "ambiguity": 23},
    "45": {"goal": "Identify objects in the room that could be used for sitting.", "complexity": 42, "ambiguity": 25},
    "46": {"goal": "Navigate to each corner of the room, starting from the closest to the light switch.", "complexity": 43, "ambiguity": 27},
    "47": {"goal": "Find an object that could be used as a writing surface.", "complexity": 44, "ambiguity": 33},
    "48": {"goal": "Press the light switch near the cabinet, then move to the couch.", "complexity": 45, "ambiguity": 28},
    "49": {"goal": "Count how many objects are on each piece of furniture.", "complexity": 46, "ambiguity": 30},
    "50": {"goal": "Find a comfortable place for a person to sit and read.", "complexity": 47, "ambiguity": 35},
    "51": {"goal": "Locate all objects that appear to be movable, and categorize them by size.", "complexity": 48, "ambiguity": 32},
    "52": {"goal": "Inspect the couch and all objects within a 1-meter radius of it.", "complexity": 49, "ambiguity": 23},
    "53": {"goal": "Press the light switch, examine the plant, and then move the water pitcher to the table.", "complexity": 50, "ambiguity": 25},
    "54": {"goal": "Find all objects in the room that might contain or have once contained water.", "complexity": 51, "ambiguity": 37},
    "55": {"goal": "Investigate which object in the room appears most out of place.", "complexity": 52, "ambiguity": 38},
    "56": {"goal": "Locate all objects that could potentially be used for entertainment.", "complexity": 53, "ambiguity": 40},
    "57": {"goal": "Create a path through the room that allows visiting each piece of furniture without crossing the same spot twice.", "complexity": 54, "ambiguity": 33},
    "58": {"goal": "Find objects in the room that could be used to create a makeshift barrier.", "complexity": 55, "ambiguity": 42},
    "59": {"goal": "Identify which light switch controls which light in the room.", "complexity": 56, "ambiguity": 35},
    "60": {"goal": "Determine the most efficient route to water the plant, starting from the furthest point in the room.", "complexity": 57, "ambiguity": 37},
    "61": {"goal": "Check each piece of furniture for objects that don't belong there.", "complexity": 58, "ambiguity": 38},
    "62": {"goal": "Find three objects that could be stacked on top of each other safely.", "complexity": 59, "ambiguity": 43},
    "63": {"goal": "Press the light switch, then locate all objects that cast a shadow.", "complexity": 60, "ambiguity": 45},
    "64": {"goal": "Identify objects in the room that could be used in an emergency situation.", "complexity": 61, "ambiguity": 47},
    "65": {"goal": "Navigate around the room in a way that minimizes the distance traveled while visiting each light switch.", "complexity": 62, "ambiguity": 40},
    "66": {"goal": "Find objects in the room that could be used to make a noise.", "complexity": 63, "ambiguity": 48},
    "67": {"goal": "Locate any object that might contain important documents or information.", "complexity": 64, "ambiguity": 50},
    "68": {"goal": "Identify all objects that would be dangerous to touch with wet hands.", "complexity": 65, "ambiguity": 52},
    "69": {"goal": "Find the most secluded spot in the room that's still comfortable for a person.", "complexity": 66, "ambiguity": 53},
    "70": {"goal": "Press the light switch furthest from the plant, then check if any objects have changed appearance.", "complexity": 67, "ambiguity": 42},
    "71": {"goal": "Create a cozy reading nook using objects available in the room.", "complexity": 68, "ambiguity": 55},
    "72": {"goal": "Locate all objects in the room that might need regular maintenance.", "complexity": 69, "ambiguity": 57},
    "73": {"goal": "Identify which objects in the room might be easily damaged by sunlight.", "complexity": 70, "ambiguity": 58},
    "74": {"goal": "Find all objects that could potentially be fire hazards if left unattended.", "complexity": 71, "ambiguity": 60},
    "75": {"goal": "Determine which objects in the room would be most valuable in a survival situation.", "complexity": 72, "ambiguity": 62},
    "76": {"goal": "Press each light switch in order of increasing distance from the plant, then water the plant.", "complexity": 73, "ambiguity": 43},
    "77": {"goal": "Identify all objects that might change state or appearance when interacted with.", "complexity": 74, "ambiguity": 63},
    "78": {"goal": "Arrange the room to optimize for a small social gathering of four people.", "complexity": 75, "ambiguity": 65},
    "79": {"goal": "Find a way to temporarily block all natural light from entering the room.", "complexity": 76, "ambiguity": 67},
    "80": {"goal": "Locate all objects that might be used differently depending on the time of day.", "complexity": 77, "ambiguity": 68},
    "81": {"goal": "Inspect the room for any potential tripping hazards and suggest how to fix them.", "complexity": 78, "ambiguity": 70},
    "82": {"goal": "Determine which objects in the room would be most difficult to replace if lost.", "complexity": 79, "ambiguity": 72},
    "83": {"goal": "Locate all objects that could be used to measure or estimate distance or time.", "complexity": 80, "ambiguity": 73},
    "84": {"goal": "Press the light switch, water the plant, move the water pitcher to the table, and then find a comfortable seat, all while minimizing the distance traveled.", "complexity": 81, "ambiguity": 45},
    "85": {"goal": "Identify objects in the room that might make different sounds when interacted with.", "complexity": 82, "ambiguity": 75},
    "86": {"goal": "Create a temporary workspace suitable for a laptop and writing materials using available furniture.", "complexity": 83, "ambiguity": 77},
    "87": {"goal": "Find all objects in the room that would be difficult to move without assistance.", "complexity": 84, "ambiguity": 78},
    "88": {"goal": "Determine the most energy-efficient arrangement of furniture and lighting in the room.", "complexity": 85, "ambiguity": 80},
    "89": {"goal": "Locate objects that might change the room's atmosphere or mood when manipulated.", "complexity": 86, "ambiguity": 82},
    "90": {"goal": "Create a path through the room that would be suitable for someone with mobility limitations.", "complexity": 87, "ambiguity": 83},
    "91": {"goal": "Identify all objects in the room that could potentially be repurposed for a different function.", "complexity": 88, "ambiguity": 85},
    "92": {"goal": "Determine which combination of objects would create the most comfortable sleeping arrangement in an emergency.", "complexity": 89, "ambiguity": 87},
    "93": {"goal": "Check all objects that might need adjustment or repair to function optimally.", "complexity": 90, "ambiguity": 88},
    "94": {"goal": "Create an arrangement of furniture and objects that would be most conducive to productive work.", "complexity": 91, "ambiguity": 90},
    "95": {"goal": "Locate all objects that might have sentimental value to a typical occupant of this room.", "complexity": 92, "ambiguity": 92},
    "96": {"goal": "Press each light switch in a sequence that creates the most dramatic lighting effect, then rearrange objects to best showcase their appearance under this lighting.", "complexity": 93, "ambiguity": 93},
    "97": {"goal": "Find all objects in the room that could be used to create a makeshift communication system between two rooms.", "complexity": 94, "ambiguity": 95},
    "98": {"goal": "Determine which objects in the room would be most useful during a power outage lasting several days.", "complexity": 95, "ambiguity": 97},
    "99": {"goal": "Create a secure, hidden storage location using only objects currently in the room.", "complexity": 97, "ambiguity": 98},
    "100": {"goal": "Reorganize the entire room to maximize both aesthetic appeal and functional efficiency while ensuring all objects are still accessible, properly illuminated, and arranged according to their logical relationship to each other and typical usage patterns.", "complexity": 100, "ambiguity": 100}
} 